proxy_extract.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-10-09 Sun 09:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Proxy_extract - extract proxy authentication from password store</title>
<meta name="author" content="Pradyumna Paranjape" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Proxy_extract - extract proxy authentication from password store</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbce1fdb">Description</a>
<ul>
<li><a href="#org8a9e357">plain password</a></li>
<li><a href="#org71edcdf">multi-field</a></li>
</ul>
</li>
<li><a href="#org4537a49">Code</a>
<ul>
<li><a href="#org96d442c">Check availability</a></li>
<li><a href="#org83e34a7">Handle global variables and exits</a></li>
<li><a href="#org6812268">Parse command</a></li>
<li><a href="#org1a20381">Extractor</a></li>
<li><a href="#org29f5bd6">Compiler</a></li>
<li><a href="#org9707a2f">Main routine call</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgbce1fdb" class="outline-2">
<h2 id="orgbce1fdb">Description</h2>
<div class="outline-text-2" id="text-orgbce1fdb">
<ul class="org-ul">
<li>This script is automatically called by <code>bin/proxy_extract.sh</code>.</li>
<li><p>
This may be used in <code>${XDG_CONFIG_HOME:-${HOME}/.config}/pvt.d/.proxyrc</code>
to extract proxy settings from the password store.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ffffaf;">all_proxy</span>=<span style="color: #98be65;">"$(${RUNCOMDIR:-${HOME}/.runcom}/bin/proxy_extract.sh)"</span>
<span style="color: #ffffaf;">http_proxy</span>=<span style="color: #98be65;">"${all_proxy}"</span>
<span style="color: #ffffaf;">https_proxy</span>=<span style="color: #98be65;">"${all_proxy}"</span>
<span style="color: #ffffaf;">ftp_proxy</span>=<span style="color: #98be65;">"${all_proxy}"</span>
<span style="color: #ffffaf;">ftps_proxy</span>=<span style="color: #98be65;">"${all_proxy}"</span>

<span style="color: #d76f10;">export</span> all_proxy
<span style="color: #d76f10;">export</span> http_proxy
<span style="color: #d76f10;">export</span> https_proxy
<span style="color: #d76f10;">export</span> ftp_proxy
<span style="color: #d76f10;">export</span> ftps_proxy
</pre>
</div>

<ul class="org-ul">
<li><a href="https://www.passwordstore.org">Password manager</a> may hold the proxy-secret.</li>
<li>Pass-name to the secret <b>MUST</b> be stored in an environment variable <code>${proxy_auth}</code>.</li>
<li>Secret MUST <b>NOT</b> be url-encoded.

<ul class="org-ul">
<li><p>
<i>pass-name</i> can be declared by adding following lines to
<code>${XDG_CONFIG_HOME:-${HOME/.config}/(pvt|local).d/.&lt;some_name&gt;rc</code>
</p>
<div class="seealso" id="org4acba3a">
<ul class="org-ul">
<li><a href="setup.html#org087091f">Personalization</a></li>
</ul>

</div>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ffffaf;">proxy_auth</span>=<span style="color: #98be65;">"office/proxy_server.example.com/best_employee"</span>
<span style="color: #d76f10;">export</span> proxy_auth
</pre>
</div></li>
</ul></li>

<li>Secret <b>MUST</b> be stored in either of following formats.</li>
</ul></li>
</ul>
</div>

<div id="outline-container-org8a9e357" class="outline-3">
<h3 id="org8a9e357">plain password</h3>
<div class="outline-text-3" id="text-org8a9e357">
<p>
Password store stores just the &lt;password&gt;.
&lt;password&gt; may be stored in password manager using a command such as:
</p>
<div class="org-src-container">
<pre class="src src-sh">pass insert office/proxy_server.example.com/best_employee
</pre>
</div>
</div>
</div>

<div id="outline-container-org71edcdf" class="outline-3">
<h3 id="org71edcdf">multi-field</h3>
<div class="outline-text-3" id="text-org71edcdf">
<p>
Information about <i>any</i> or <i>all</i> of following fields may be provided.
</p>
<ul class="org-ul">
<li><p>
Order is not strict.
</p>

<div class="org-src-container">
<pre class="src src-yml">protocol: &lt;proxy protocol&gt;
username: &lt;username in plain text&gt;
password: &lt;password in plain text&gt;
address: &lt;proxy server address&gt;
port: &lt;proxy port&gt;

</pre>
</div>

<p>
Fields may be stored in password manager using a command such as:
</p>
<div class="org-src-container">
<pre class="src src-sh">pass insert -m office/proxy_server.example.com/best_employee
</pre>
</div></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4537a49" class="outline-2">
<h2 id="org4537a49">Code</h2>
<div class="outline-text-2" id="text-org4537a49">
<p>
This section tangles the code (POSIX)
</p>
</div>
<div id="outline-container-org96d442c" class="outline-3">
<h3 id="org96d442c">Check availability</h3>
<div class="outline-text-3" id="text-org96d442c">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">affirm_availability</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">for</span> _import<span style="color: #51afef;"> in</span> pass curl; <span style="color: #51afef;">do</span>
        <span style="color: #51afef;">if</span> <span style="color: #51afef; font-weight: bold;">!</span> command -v <span style="color: #98be65;">"${_import}"</span> &gt;/dev/null <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #51afef;">then</span>
            <span style="color: #d76f10;">unset</span> _import
            clean_exit <span style="color: #da8548; font-weight: bold;">127</span> <span style="color: #98be65;">"${_import} is not installed\n"</span>
        <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">done</span>
    <span style="color: #d76f10;">unset</span> _import
<span style="color: #51afef;">}</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org83e34a7" class="outline-3">
<h3 id="org83e34a7">Handle global variables and exits</h3>
<div class="outline-text-3" id="text-org83e34a7">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">set_vars</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #ffffaf;">show</span>=false
    <span style="color: #ffffaf;">proxy_header</span>=
    <span style="color: #ffffaf;">pass_keys</span>=
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -z <span style="color: #98be65;">"${proxy_protocol}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #ffffaf;">proxy_protocol</span>=<span style="color: #98be65;">'all'</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #ffffaf;">proxy_username</span>=
    <span style="color: #ffffaf;">proxy_password</span>=
    <span style="color: #ffffaf;">proxy_host</span>=
    <span style="color: #ffffaf;">proxy_port</span>=
    <span style="color: #ffffaf;">usage</span>=<span style="color: #98be65;">"</span>
<span style="color: #98be65;">    usage: ${0} -h</span>
<span style="color: #98be65;">    usage: ${0} --help</span>
<span style="color: #98be65;">    usage: ${0}</span>
<span style="color: #98be65;">"</span>
    <span style="color: #ffffaf;">help_msg</span>=<span style="color: #98be65;">"${usage}</span>

<span style="color: #98be65;">    DESCRIPTION: |</span>
<span style="color: #98be65;">      extract proxy authentication from password store</span>


<span style="color: #98be65;">    Optional Arguments: |</span>
<span style="color: #98be65;">      -h\t\t\tprint usage message and exit</span>
<span style="color: #98be65;">      --help\t\t\tprint this help message and exit</span>

<span style="color: #98be65;">"</span>
<span style="color: #51afef;">}</span>

<span style="color: #9f5f9f; font-weight: bold;">unset_vars</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #d76f10;">unset</span> help_msg
    <span style="color: #d76f10;">unset</span> usage
    <span style="color: #d76f10;">unset</span> proxy_port
    <span style="color: #d76f10;">unset</span> proxy_host
    <span style="color: #d76f10;">unset</span> proxy_password
    <span style="color: #d76f10;">unset</span> proxy_username
    <span style="color: #d76f10;">unset</span> pass_keys
    <span style="color: #d76f10;">unset</span> proxy_header
<span style="color: #51afef;">}</span>


<span style="color: #9f5f9f; font-weight: bold;">clean_exit</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    unset_vars
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -n <span style="color: #98be65;">"${1}"</span> <span style="color: #c678dd;">]</span> &amp;&amp; <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"${1}"</span> -ne <span style="color: #98be65;">"0"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -n <span style="color: #98be65;">"${2}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
            <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2059</span>
            printf <span style="color: #98be65;">"${2}\n"</span> &gt;&amp;<span style="color: #da8548; font-weight: bold;">2</span>
        <span style="color: #51afef;">fi</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2086</span>
        <span style="color: #51afef;">exit</span> $<span style="color: #c678dd;">{</span><span style="color: #da8548; font-weight: bold;">1</span><span style="color: #c678dd;">}</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -n <span style="color: #98be65;">"${2}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2059</span>
        printf <span style="color: #98be65;">"${2}\n"</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">exit</span> <span style="color: #da8548; font-weight: bold;">0</span>
<span style="color: #51afef;">}</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org6812268" class="outline-3">
<h3 id="org6812268">Parse command</h3>
<div class="outline-text-3" id="text-org6812268">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">cli</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">while</span> <span style="color: #c678dd;">[</span> $<span style="color: #ffffaf;">#</span> -gt <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">do</span>
        <span style="color: #51afef;">case</span> <span style="color: #98be65;">"${1}"</span><span style="color: #51afef;"> in</span>
            -h)
                <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2059</span>
                clean_exit <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #98be65;">"${usage}"</span>
                ;;
            --help)
                <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2059</span>
                clean_exit <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #98be65;">"${help_msg}"</span>
                ;;
            -s|--show)
                <span style="color: #ffffaf;">show</span>=true
                <span style="color: #d76f10;">shift</span>
                ;;
            *)
                clean_exit <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #98be65;">"${usage}"</span>
        <span style="color: #51afef;">esac</span>
    <span style="color: #51afef;">done</span>
<span style="color: #51afef;">}</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org1a20381" class="outline-3">
<h3 id="org1a20381">Extractor</h3>
</div>
<div id="outline-container-org29f5bd6" class="outline-3">
<h3 id="org29f5bd6">Compiler</h3>
<div class="outline-text-3" id="text-org29f5bd6">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">compile_proxy</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -z <span style="color: #98be65;">"${proxy_host}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #51afef;">return</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -n <span style="color: #98be65;">"${proxy_protocol}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"${proxy_protocol}"</span> = <span style="color: #98be65;">"all"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
            <span style="color: #ffffaf;">proxy_header</span>=<span style="color: #98be65;">"http://"</span>
        <span style="color: #51afef;">else</span>
            <span style="color: #ffffaf;">proxy_header</span>=<span style="color: #98be65;">"${proxy_protocol}://"</span>
        <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -n <span style="color: #98be65;">"${proxy_username}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #ffffaf;">scrt</span>=<span style="color: #98be65;">"${proxy_username}"</span>
        <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -n <span style="color: #98be65;">"${proxy_password}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
            <span style="color: #ffffaf;">scrt</span>=<span style="color: #98be65;">"${proxy_username}:${proxy_password}"</span>
        <span style="color: #51afef;">fi</span>
        <span style="color: #ffffaf;">proxy_header</span>=<span style="color: #98be65;">"${proxy_header}${scrt}@"</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #ffffaf;">proxy_header</span>=<span style="color: #98be65;">"${proxy_header}${proxy_host}"</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -n <span style="color: #98be65;">"${proxy_port}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #ffffaf;">proxy_header</span>=<span style="color: #98be65;">"${proxy_header}:${proxy_port}"</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #ffffaf;">proxy_header</span>=<span style="color: #98be65;">"${proxy_header}/"</span>
    <span style="color: #d76f10;">unset</span> scrt
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9707a2f" class="outline-3">
<h3 id="org9707a2f">Main routine call</h3>
<div class="outline-text-3" id="text-org9707a2f">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">Main routine call</span>
    set_vars
    cli <span style="color: #98be65;">"$@"</span>
    get_pass_proxy
    compile_proxy
    printf <span style="color: #98be65;">"%s\n"</span> <span style="color: #98be65;">"${proxy_header}"</span>
    clean_exit
<span style="color: #51afef;">}</span>

main <span style="color: #98be65;">"$@"</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
